In [1]:
import pandas as pd

In [2]:
series=pd.Series([45,32,12,43])

In [3]:
series

0    45
1    32
2    12
3    43
dtype: int64

In [4]:
series1=pd.Series([5345,656,5656,7665],index=["A","B","C","D"])

In [5]:
series1

A    5345
B     656
C    5656
D    7665
dtype: int64

In [6]:
series1["A"]

5345

In [7]:
series1[["A","C"]]

A    5345
C    5656
dtype: int64

In [8]:
Data_Frame=pd.DataFrame([{"col1":[4,5,6,7],"col2":45}])

In [9]:
Data_Frame

           col1  col2
0  [4, 5, 6, 7]    45

In [10]:
Data_Frame1=pd.DataFrame([{"col1":[4,5,6,7],"col2":45},{"col1":56,"col2":4455}])

In [11]:
Data_Frame1

           col1  col2
0  [4, 5, 6, 7]    45
1            56  4455

In [12]:
Data_Frame2=pd.DataFrame({"col1":[3],"col2":[4]})

In [13]:
Data_Frame2

   col1  col2
0     3     4

In [14]:
Data_Frame

           col1  col2
0  [4, 5, 6, 7]    45

In [15]:
import numpy as np
D=pd.DataFrame(np.arange(6).reshape(2,3),index=["row1","row2"],columns=["col1","col2","col3"])
print(D)

      col1  col2  col3
row1     0     1     2
row2     3     4     5

In [16]:

dictionary={"one":1,"two":2,"three":3,"four":4,"five":5,"six":6}

In [17]:
ser=pd.Series(dictionary)

In [18]:
ser

one      1
two      2
three    3
four     4
five     5
six      6
dtype: int64

In [20]:
ser.reindex(["five","four","three","two","one","six"])

five     5
four     4
three    3
two      2
one      1
six      6
dtype: int64

In [21]:
ser

one      1
two      2
three    3
four     4
five     5
six      6
dtype: int64

In [23]:
ser.index=[1,2,3,4,5,6]

In [24]:
ser

1    1
2    2
3    3
4    4
5    5
6    6
dtype: int64

In [25]:
type(D)

pandas.core.frame.DataFrame

In [26]:
Data=pd.read_csv("Book1.csv")

In [27]:
Data

   Name   class   Id
0      A  sec E  332
1      B  sec E  344
2      C  sec D  453
3      D  sec D  435
4      E  sec C  342
5      F  sec C  889
6      G  sec B  977
7      H  sec B  687
8      I  sec A  564
9      J  sec A  577
10     K  sec F  534
11     L  sec E  342
12     M  sec B  768
13     N  sec C  989

In [28]:
Data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 14 entries, 0 to 13
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    14 non-null     object
 1   class   14 non-null     object
 2   Id      14 non-null     int64
dtypes: int64(1), object(2)
memory usage: 464.0+ bytes

In [29]:
Data.head(7)

  Name   class   Id
0     A  sec E  332
1     B  sec E  344
2     C  sec D  453
3     D  sec D  435
4     E  sec C  342
5     F  sec C  889
6     G  sec B  977

In [30]:
Data.tail(10)

   Name   class   Id
4      E  sec C  342
5      F  sec C  889
6      G  sec B  977
7      H  sec B  687
8      I  sec A  564
9      J  sec A  577
10     K  sec F  534
11     L  sec E  342
12     M  sec B  768
13     N  sec C  989

In [32]:
type(Data)

pandas.core.frame.DataFrame

In [33]:
Data.head()

  Name   class   Id
0     A  sec E  332
1     B  sec E  344
2     C  sec D  453
3     D  sec D  435
4     E  sec C  342

In [35]:
Data.tail()

   Name   class   Id
9      J  sec A  577
10     K  sec F  534
11     L  sec E  342
12     M  sec B  768
13     N  sec C  989

In [36]:
Data.index[1]

1

In [39]:
Data.columns=["student","section","ID"]

In [40]:
Data

   student section   ID
0        A   sec E  332
1        B   sec E  344
2        C   sec D  453
3        D   sec D  435
4        E   sec C  342
5        F   sec C  889
6        G   sec B  977
7        H   sec B  687
8        I   sec A  564
9        J   sec A  577
10       K   sec F  534
11       L   sec E  342
12       M   sec B  768
13       N   sec C  989

In [42]:
Data["student"][1]

'B'

In [47]:
Data["ID"]>500

0     False
1     False
2     False
3     False
4     False
5      True
6      True
7      True
8      True
9      True
10     True
11    False
12     True
13     True
Name: ID, dtype: bool

In [48]:
Data["ID"].sum()

8233

In [49]:
Data["ID"].max()

989

In [50]:
Data["ID"].min()

332

In [56]:
Data["ID"].count()

14